In [6]:
cd C:\Users\mc_kleach26\.cache\kagglehub\datasets\sakshisatre\titanic-dataset\versions\2

C:\Users\mc_kleach26\.cache\kagglehub\datasets\sakshisatre\titanic-dataset\versions\2

In [7]:
import pandas as pd
from sklearn.model_selection import train_test_split  
from sklearn.tree import DecisionTreeClassifier, plot_tree  
from sklearn.metrics import accuracy_score, classification_report 
import matplotlib.pyplot as plt 
import kagglehub

In [8]:
# Download the Titanic dataset from Kaggle
path = kagglehub.dataset_download("sakshisatre/titanic-dataset")
print("Path to dataset files:", path)

df = pd.read_csv("The Titanic Dataset.csv")

Path to dataset files: C:\Users\mc_kleach26\.cache\kagglehub\datasets\sakshisatre\titanic-dataset\versions\2

In [9]:
df

,1,2,3,4,5,6,7,8,9,10
0,sn,pclass,survived,NaN,gender,age,family,fare,embarked,date
1,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
2,1,3,0,Mr. Anthony,male,42,0,7.55,NaN,01-Jan-90
3,2,3,0,Master. Eugene Joseph,male,?,2,20.25,S,02-Jan-90
4,3,2,0,"Abbott, Mr. Rossmore Edward",NaN,NaN,2,**,S,03-Jan-90
...,...,...,...,...,...,...,...,...,...,...
1297,1296,2,0,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24,0,13,S,19-Jul-93
1298,1297,3,0,"Zabour, Miss. Hileni",female,14.5,1,14.4542,C,20-Jul-93
1299,1298,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,7.225,C,21-Jul-93
1300,1299,3,0,"Zakarian, Mr. Ortin",male,27,0,7.225,C,22-Jul-93
1301,1300,3,0,"Zimmerman, Mr. Leo",male,29,0,7.875,S,23-Jul-93